#pragma once
#include <inttypes.h>

// Крестик (ошибка, нет GPS)
static const uint8_t cross[][2] = {
    // Диагональ слева направо
    {0, 0},
    {1, 1},
    {2, 2},
    {3, 3},
    {4, 4},
    {5, 5},
    {6, 6},

    // Диагональ справа налево
    {0, 6},
    {1, 5},
    {2, 4},
    // {3, 3}, // Центр дублируется, не рисуем
    {4, 2},
    {5, 1},
    {6, 0},
    {4, 2},
    {5, 1},
    {6, 0},
};

// Рамка батарейки (контур)
static const uint8_t battery_frame[][2] = {
    {0, 0}, {0, 1}, {0, 2}, {0, 3},           // левая сторона
    {5, 0}, {5, 1}, {5, 2}, {5, 3},           // правая сторона
    {1, 0}, {2, 0}, {3, 0}, {4, 0}, {5, 0},   // верх
    {1, 3}, {2, 3}, {3, 3}, {4, 3}, {5, 3},   // низ
    // Контакт батарейки (справа)
    {6, 1}, {6, 2}
};

// Полная батарейка (заряжена)
static const uint8_t battery_full[][2] = {
    {0, 0}, {0, 1}, {0, 2}, {0, 3},           // левая сторона
    {5, 0}, {5, 1}, {5, 2}, {5, 3},           // правая сторона
    {1, 0}, {2, 0}, {3, 0}, {4, 0}, {5, 0},   // верх
    {1, 3}, {2, 3}, {3, 3}, {4, 3}, {5, 3},   // низ
    // Контакт батарейки (справа)
    {6, 1}, {6, 2},

    // Заполнение
    {1, 1}, {2, 1}, {3, 1}, {4, 1},
    {1, 2}, {2, 2}, {3, 2}, {4, 2}
};